In [2]:
People = {
    "first": ["Corey","Jane","John"],
    "last": ["Schafer","Doe","Doe"],
    "email":["CoreyMSchafer@mail.com","JaneDoe@mail.com","JohnDoe@mail.com"]
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(People)

In [5]:
df

   first     last                   email
0  Corey  Schafer  CoreyMSchafer@mail.com
1   Jane      Doe        JaneDoe@mail.com
2   John      Doe        JohnDoe@mail.com

In [6]:
df["email"]

0    CoreyMSchafer@mail.com
1          JaneDoe@mail.com
2          JohnDoe@mail.com
Name: email, dtype: object

In [7]:
type(df["email"])

pandas.core.series.Series

In [8]:
df.email

0    CoreyMSchafer@mail.com
1          JaneDoe@mail.com
2          JohnDoe@mail.com
Name: email, dtype: object

In [10]:
df[["last","email"]]

      last                   email
0  Schafer  CoreyMSchafer@mail.com
1      Doe        JaneDoe@mail.com
2      Doe        JohnDoe@mail.com

In [11]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [12]:
df.iloc[0]

first                     Corey
last                    Schafer
email    CoreyMSchafer@mail.com
Name: 0, dtype: object

In [15]:
df.iloc[[0,1],2]

0    CoreyMSchafer@mail.com
1          JaneDoe@mail.com
Name: email, dtype: object

In [17]:
df.loc[0]

first                     Corey
last                    Schafer
email    CoreyMSchafer@mail.com
Name: 0, dtype: object

In [18]:
df.loc[[0,1]]

   first     last                   email
0  Corey  Schafer  CoreyMSchafer@mail.com
1   Jane      Doe        JaneDoe@mail.com

In [19]:
df.loc[[0,1],'email']

0    CoreyMSchafer@mail.com
1          JaneDoe@mail.com
Name: email, dtype: object

In [20]:
df.loc[[0,1],['email','last']]

                    email     last
0  CoreyMSchafer@mail.com  Schafer
1        JaneDoe@mail.com      Doe

In [21]:
df["email"]

0    CoreyMSchafer@mail.com
1          JaneDoe@mail.com
2          JohnDoe@mail.com
Name: email, dtype: object

In [23]:
df.set_index("email")

                        first     last
email
CoreyMSchafer@mail.com  Corey  Schafer
JaneDoe@mail.com         Jane      Doe
JohnDoe@mail.com         John      Doe

In [24]:
df

   first     last                   email
0  Corey  Schafer  CoreyMSchafer@mail.com
1   Jane      Doe        JaneDoe@mail.com
2   John      Doe        JohnDoe@mail.com

In [25]:
df.set_index("email", inplace=True)

In [26]:
df

                        first     last
email
CoreyMSchafer@mail.com  Corey  Schafer
JaneDoe@mail.com         Jane      Doe
JohnDoe@mail.com         John      Doe

In [27]:
df.index

Index(['CoreyMSchafer@mail.com', 'JaneDoe@mail.com', 'JohnDoe@mail.com'], dtype='object', name='email')

In [28]:
df.loc['CoreyMSchafer@mail.com']

first      Corey
last     Schafer
Name: CoreyMSchafer@mail.com, dtype: object

In [29]:
df.loc['CoreyMSchafer@mail.com','last']

'Schafer'

In [30]:
df.iloc[0]

first      Corey
last     Schafer
Name: CoreyMSchafer@mail.com, dtype: object

In [31]:
df.reset_index(inplace=True)

In [32]:
df

                    email  first     last
0  CoreyMSchafer@mail.com  Corey  Schafer
1        JaneDoe@mail.com   Jane      Doe
2        JohnDoe@mail.com   John      Doe

In [34]:
filt = df["last"]=="Doe"
filt

0    False
1     True
2     True
Name: last, dtype: bool

In [35]:
df[filt]

              email first last
1  JaneDoe@mail.com  Jane  Doe
2  JohnDoe@mail.com  John  Doe

In [37]:
df[df["last"]=="Doe"]

              email first last
1  JaneDoe@mail.com  Jane  Doe
2  JohnDoe@mail.com  John  Doe

In [40]:
df.loc[filt, 'email']

1    JaneDoe@mail.com
2    JohnDoe@mail.com
Name: email, dtype: object

In [42]:
filt = (df["last"]=="Doe") & (df["first"]=="John")
filt

0    False
1    False
2     True
dtype: bool

In [43]:
df.loc[filt, 'email']

2    JohnDoe@mail.com
Name: email, dtype: object

In [45]:
filt = (df["last"]=="Doe") | (df["first"]=="John")
filt

0    False
1     True
2     True
dtype: bool

In [46]:
df.loc[filt, 'email']

1    JaneDoe@mail.com
2    JohnDoe@mail.com
Name: email, dtype: object

In [47]:
df.loc[-filt, 'email']

0    CoreyMSchafer@mail.com
Name: email, dtype: object

In [49]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [51]:
df.columns = ["email","first_name","last_name"]

In [52]:
df

                    email first_name last_name
0  CoreyMSchafer@mail.com      Corey   Schafer
1        JaneDoe@mail.com       Jane       Doe
2        JohnDoe@mail.com       John       Doe

In [53]:
df.columns = [x.upper() for x in df.columns]

In [54]:
df

                    EMAIL FIRST_NAME LAST_NAME
0  CoreyMSchafer@mail.com      Corey   Schafer
1        JaneDoe@mail.com       Jane       Doe
2        JohnDoe@mail.com       John       Doe

In [58]:
df.columns = df.columns.str.replace("+","_",regex=True)
df

                    EMAIL FIRST_NAME LAST_NAME
0  CoreyMSchafer@mail.com      Corey   Schafer
1        JaneDoe@mail.com       Jane       Doe
2        JohnDoe@mail.com       John       Doe

In [62]:
df.rename(columns={"FIRST_NAME":"first","LAST_NAME":"last"},inplace=True)
df

                    EMAIL  first     last
0  CoreyMSchafer@mail.com  Corey  Schafer
1        JaneDoe@mail.com   Jane      Doe
2        JohnDoe@mail.com   John      Doe

In [63]:
df.loc[2] = ["JohnSmith@mail.com","John","Smith"]

In [64]:
df

                    EMAIL  first     last
0  CoreyMSchafer@mail.com  Corey  Schafer
1        JaneDoe@mail.com   Jane      Doe
2      JohnSmith@mail.com   John    Smith

In [66]:
df.loc[2, ["last","email"]] = ["Doe", "DoeSmith@mail.com"]

In [67]:
df

                    email  first     last
0  CoreyMSchafer@mail.com  Corey  Schafer
1        JaneDoe@mail.com   Jane      Doe
2       DoeSmith@mail.com   John      Doe

In [72]:
df.loc[2, "last"] = "Smith"

In [69]:
df

                    email  first     last
0  CoreyMSchafer@mail.com  Corey  Schafer
1        JaneDoe@mail.com   Jane      Doe
2       DoeSmith@mail.com   John    Smith

In [73]:
df.at[2, "first"] = "Doe"

In [74]:
df

                    email  first     last
0  CoreyMSchafer@mail.com  Corey  Schafer
1        JaneDoe@mail.com   Jane      Doe
2       DoeSmith@mail.com    Doe    Smith

In [76]:
filt = (df["email"] == "JaneDoe@mail.com")
df[filt]["last"] = "Doe2"

C:\Users\01154\AppData\Local\Temp\ipykernel_32284\3451026898.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]["last"] = "Doe2"

In [78]:
df

                    email  first     last
0  CoreyMSchafer@mail.com  Corey  Schafer
1        JaneDoe@mail.com   Jane      Doe
2       DoeSmith@mail.com    Doe    Smith

In [80]:
df.loc[filt,"last"] = "Doe2"

In [82]:
df

                    email  first     last
0  CoreyMSchafer@mail.com  Corey  Schafer
1        JaneDoe@mail.com   Jane     Doe2
2       DoeSmith@mail.com    Doe    Smith

In [84]:
df["email"].str.lower()

0    coreymschafer@mail.com
1          janedoe@mail.com
2         doesmith@mail.com
Name: email, dtype: object

In [88]:
df["email"] = df["email"].str.lower()
df

                    email  first     last
0  coreymschafer@mail.com  Corey  Schafer
1        janedoe@mail.com   Jane     Doe2
2       doesmith@mail.com    Doe    Smith

In [89]:
df["email"].apply(len)

0    22
1    16
2    17
Name: email, dtype: int64

In [90]:
def upper_email(email):
    return email.upper()

In [92]:
df["email"].apply(upper_email)

0    COREYMSCHAFER@MAIL.COM
1          JANEDOE@MAIL.COM
2         DOESMITH@MAIL.COM
Name: email, dtype: object

In [94]:
df["email"] = df["email"].apply(upper_email)
df

                    email  first     last
0  COREYMSCHAFER@MAIL.COM  Corey  Schafer
1        JANEDOE@MAIL.COM   Jane     Doe2
2       DOESMITH@MAIL.COM    Doe    Smith

In [95]:
df["email"] = df["email"].apply(lambda x:x.lower())
df

                    email  first     last
0  coreymschafer@mail.com  Corey  Schafer
1        janedoe@mail.com   Jane     Doe2
2       doesmith@mail.com    Doe    Smith

In [96]:
df.apply(len)

email    3
first    3
last     3
dtype: int64

In [98]:
len(df["email"])

3

In [99]:
df.apply(len, axis="rows")

email    3
first    3
last     3
dtype: int64

In [100]:
df.apply(len, axis="columns")

0    3
1    3
2    3
dtype: int64

In [101]:
df.apply(pd.Series.min)

email    coreymschafer@mail.com
first                     Corey
last                       Doe2
dtype: object

In [102]:
df.apply(lambda x:x.min())

email    coreymschafer@mail.com
first                     Corey
last                       Doe2
dtype: object

In [103]:
df.applymap(len)

   email  first  last
0     22      5     7
1     16      4     4
2     17      3     5

In [107]:
df.applymap(str.lower)

                    email  first     last
0  coreymschafer@mail.com  corey  schafer
1        janedoe@mail.com   jane     doe2
2       doesmith@mail.com    doe    smith

In [109]:
df["first"].map({"Corey":"Chris","Jane":"Mary"})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [112]:
df["first"] = df["first"].replace({"Corey":"Chris","Jane":"Mary"})
df

                    email  first     last
0  coreymschafer@mail.com  Chris  Schafer
1        janedoe@mail.com   Mary     Doe2
2       doesmith@mail.com    Doe    Smith

In [114]:
df["first"] + ' ' + df["last"]

0    Chris Schafer
1        Mary Doe2
2        Doe Smith
dtype: object

In [115]:
df["full_name"] = df["first"] + ' ' + df["last"]

In [116]:
df

                    email  first     last      full_name
0  coreymschafer@mail.com  Chris  Schafer  Chris Schafer
1        janedoe@mail.com   Mary     Doe2      Mary Doe2
2       doesmith@mail.com    Doe    Smith      Doe Smith

In [118]:
df.drop(columns=["first","last"])

                    email      full_name
0  coreymschafer@mail.com  Chris Schafer
1        janedoe@mail.com      Mary Doe2
2       doesmith@mail.com      Doe Smith

In [119]:
df["full_name"].str.split(" ")

0    [Chris, Schafer]
1        [Mary, Doe2]
2        [Doe, Smith]
Name: full_name, dtype: object

In [120]:
df["full_name"].str.split(" ", expand=True)

       0        1
0  Chris  Schafer
1   Mary     Doe2
2    Doe    Smith

In [122]:
df = df.drop(columns=["first","last"])

In [124]:
df[["first","last"]] = df["full_name"].str.split(" ", expand=True)

In [126]:
df

                    email      full_name  first     last
0  coreymschafer@mail.com  Chris Schafer  Chris  Schafer
1        janedoe@mail.com      Mary Doe2   Mary     Doe2
2       doesmith@mail.com      Doe Smith    Doe    Smith

In [128]:
People = {
    "first": ["Corey","Jane","John"],
    "last": ["Schafer","Doe","Doe"],
    "email":["CoreyMSchafer@mail.com","JaneDoe@mail.com","JohnDoe@mail.com"]
}
df2 = pd.DataFrame(People)

In [130]:
df2

   first     last                   email
0  Corey  Schafer  CoreyMSchafer@mail.com
1   Jane      Doe        JaneDoe@mail.com
2   John      Doe        JohnDoe@mail.com

In [136]:
df.append(df2,ignore_index=True,sort=False)

C:\Users\01154\AppData\Local\Temp\ipykernel_32284\1395412685.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2,ignore_index=True,sort=False)

                    email      full_name  first     last
0  coreymschafer@mail.com  Chris Schafer  Chris  Schafer
1        janedoe@mail.com      Mary Doe2   Mary     Doe2
2       doesmith@mail.com      Doe Smith    Doe    Smith
3  CoreyMSchafer@mail.com            NaN  Corey  Schafer
4        JaneDoe@mail.com            NaN   Jane      Doe
5        JohnDoe@mail.com            NaN   John      Doe

In [138]:
df = df.append(df2,ignore_index=True,sort=False)

C:\Users\01154\AppData\Local\Temp\ipykernel_32284\3606867443.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2,ignore_index=True,sort=False)

In [142]:
df = df.drop(index=3)
df

                    email      full_name  first     last
0  coreymschafer@mail.com  Chris Schafer  Chris  Schafer
1        janedoe@mail.com      Mary Doe2   Mary     Doe2
2       doesmith@mail.com      Doe Smith    Doe    Smith

In [144]:
filt  = df["first"] == "Doe"
df.drop(index=df[filt].index)

                    email      full_name  first     last
0  coreymschafer@mail.com  Chris Schafer  Chris  Schafer
1        janedoe@mail.com      Mary Doe2   Mary     Doe2

In [147]:
df.sort_values(by="last", ascending=False)

                    email      full_name  first     last
2       doesmith@mail.com      Doe Smith    Doe    Smith
0  coreymschafer@mail.com  Chris Schafer  Chris  Schafer
1        janedoe@mail.com      Mary Doe2   Mary     Doe2

In [150]:
df.sort_values(by=["last","first"], ascending=False)

                    email      full_name  first     last
2       doesmith@mail.com      Doe Smith    Doe    Smith
0  coreymschafer@mail.com  Chris Schafer  Chris  Schafer
1        janedoe@mail.com      Mary Doe2   Mary     Doe2

In [151]:
df.sort_values(by=["last","first"], ascending=[False, True])

                    email      full_name  first     last
2       doesmith@mail.com      Doe Smith    Doe    Smith
0  coreymschafer@mail.com  Chris Schafer  Chris  Schafer
1        janedoe@mail.com      Mary Doe2   Mary     Doe2

In [152]:
df.sort_values(by=["last","first"], ascending=[False, True],inplace=True)
df

                    email      full_name  first     last
2       doesmith@mail.com      Doe Smith    Doe    Smith
0  coreymschafer@mail.com  Chris Schafer  Chris  Schafer
1        janedoe@mail.com      Mary Doe2   Mary     Doe2

In [153]:
df.sort_index()

                    email      full_name  first     last
0  coreymschafer@mail.com  Chris Schafer  Chris  Schafer
1        janedoe@mail.com      Mary Doe2   Mary     Doe2
2       doesmith@mail.com      Doe Smith    Doe    Smith

In [154]:
df["last"].sort_values()

1       Doe2
0    Schafer
2      Smith
Name: last, dtype: object